In [30]:
import pandas as pd
import numpy as np

### 다중 인덱스
데이터프레임에 여러 계층을 가지는 인덱스를 지정할 수 있다.  
데이터프레임 생성 시 `columns`인수로 다차원 리스트 형태를 지정하는 다중 인덱스로 지정할 수 있더.

In [31]:
df = pd.DataFrame(np.random.randn(5, 4).round(2), columns = [[ 'A', 'A', 'B', 'B' ], [ 'C1', 'C2', 'C1', 'C2' ] ] )
df

      A           B
     C1    C2    C1    C2
0  0.06 -1.42 -0.32 -1.14
1 -0.99  0.29  0.22  1.65
2  0.72 -0.38 -1.13 -1.31
3  1.26 -0.19  0.24  0.63
4 -0.18 -1.31 -0.29  2.22

데이터프레임의 `columns` 속성의 `names` 속성으로 각 열 인덱스에 대한 이름을 부여할 수 있음

In [32]:

df.columns.names = ['Cidx1', 'Cidx2']
df

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.06 -1.42 -0.32 -1.14
1     -0.99  0.29  0.22  1.65
2      0.72 -0.38 -1.13 -1.31
3      1.26 -0.19  0.24  0.63
4     -0.18 -1.31 -0.29  2.22

데이터 프레임 생성 시 `index` 인수로 다차원 리스트를 지정하면 다차원 형태의 행 인덱스를 지정할 수 있다.  
행 인덱스의 이름은 데이터프레임 인스턴스의 `index`속성의 `names`속성으로 지정할 수 있음

In [33]:
df2 = pd.DataFrame(np.random.randn(6, 4).round(2), 
            columns=[['A', 'A', 'B', 'B'], ['C1', 'C2', 'C1', 'C2']],
            index=[['M', 'M', 'M', 'F', 'F', 'F'], ['id_1', 'id_2', 'id_3', 'id_1', 'id_2', 'id_3']])
df2

           A           B
          C1    C2    C1    C2
M id_1 -0.89 -0.20 -1.31  0.53
  id_2 -1.05 -0.51 -0.49  0.58
  id_3  0.15  0.06 -0.95  0.49
F id_1  1.35 -0.52  0.15  0.11
  id_2 -0.90 -0.05  1.18  0.75
  id_3  1.34  0.29 -0.25  1.17

In [34]:
df2.index.names = ['Ridx1', 'Ridx2']
df2.columns.names = ['Cidx1', 'Cidx2']
df2

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1  -0.89 -0.20 -1.31  0.53
      id_2  -1.05 -0.51 -0.49  0.58
      id_3   0.15  0.06 -0.95  0.49
F     id_1   1.35 -0.52  0.15  0.11
      id_2  -0.90 -0.05  1.18  0.75
      id_3   1.34  0.29 -0.25  1.17

### 열 인덱스와 행 인덱스 교환
`stack`, `unstack` 메서드로 열 인덱스를 행 인덱스로 또는 행 인덱스를 열 인덱스로 바꿀 수 있음.  
`stack()` 메서드: 열 인덱스를 행 인덱스로 변경  
`unstack() 메서드: 행 인덱스를 열 인덱스로 변경

In [35]:
df2.stack('Cidx1')

C:\Users\ITPS\AppData\Local\Temp\ipykernel_13212\3173744584.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df2.stack('Cidx1')

Cidx2                C1    C2
Ridx1 Ridx2 Cidx1
M     id_1  A     -0.89 -0.20
            B     -1.31  0.53
      id_2  A     -1.05 -0.51
            B     -0.49  0.58
      id_3  A      0.15  0.06
            B     -0.95  0.49
F     id_1  A      1.35 -0.52
            B      0.15  0.11
      id_2  A     -0.90 -0.05
            B      1.18  0.75
      id_3  A      1.34  0.29
            B     -0.25  1.17

In [36]:
df3 = df2.stack(1)
df3

C:\Users\ITPS\AppData\Local\Temp\ipykernel_13212\4246712737.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df3 = df2.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C1    -0.89 -1.31
            C2    -0.20  0.53
      id_2  C1    -1.05 -0.49
            C2    -0.51  0.58
      id_3  C1     0.15 -0.95
            C2     0.06  0.49
F     id_1  C1     1.35  0.15
            C2    -0.52  0.11
      id_2  C1    -0.90  1.18
            C2    -0.05  0.75
      id_3  C1     1.34 -0.25
            C2     0.29  1.17

In [37]:
df4 = df2.unstack(1)
df4

Cidx1     A                                   B
Cidx2    C1                C2                C1                C2
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      1.35 -0.90  1.34 -0.52 -0.05  0.29  0.15  1.18 -0.25  0.11  0.75  1.17
M     -0.89 -1.05  0.15 -0.20 -0.51  0.06 -1.31 -0.49 -0.95  0.53  0.58  0.49

In [38]:
df4.unstack(0)

Cidx1  Cidx2  Ridx2  Ridx1
A      C1     id_1   F        1.35
                     M       -0.89
              id_2   F       -0.90
                     M       -1.05
              id_3   F        1.34
                     M        0.15
       C2     id_1   F       -0.52
                     M       -0.20
              id_2   F       -0.05
                     M       -0.51
              id_3   F        0.29
                     M        0.06
B      C1     id_1   F        0.15
                     M       -1.31
              id_2   F        1.18
                     M       -0.49
              id_3   F       -0.25
                     M       -0.95
       C2     id_1   F        0.11
                     M        0.53
              id_2   F        0.75
                     M        0.58
              id_3   F        1.17
                     M        0.49
dtype: float64

### 다중 인덱스의 인덱싱
다중 인덱스를 가지고 있는 데이터프레임의 경우 하나의 인덱스가 아니라 `()`로 둘러쌓인 튜플이어야 함

In [39]:
df

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.06 -1.42 -0.32 -1.14
1     -0.99  0.29  0.22  1.65
2      0.72 -0.38 -1.13 -1.31
3      1.26 -0.19  0.24  0.63
4     -0.18 -1.31 -0.29  2.22

In [40]:
df[('A', 'C2')]

0   -1.42
1    0.29
2   -0.38
3   -0.19
4   -1.31
Name: (A, C2), dtype: float64

In [41]:
df.loc[0, ('A', 'C1')]

0.06

만약 튜플로 지정하지 않고 단일 값으로 지정하면 제일 최상단의 인덱스를 지정하는 것으로 봄

In [42]:
df['A']

Cidx2    C1    C2
0      0.06 -1.42
1     -0.99  0.29
2      0.72 -0.38
3      1.26 -0.19
4     -0.18 -1.31

단, `iloc`인덱서를 사용할 때는 다중인덱스로 접근을 할 수 없음

In [43]:
df2

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1  -0.89 -0.20 -1.31  0.53
      id_2  -1.05 -0.51 -0.49  0.58
      id_3   0.15  0.06 -0.95  0.49
F     id_1   1.35 -0.52  0.15  0.11
      id_2  -0.90 -0.05  1.18  0.75
      id_3   1.34  0.29 -0.25  1.17

In [44]:
df2.loc[('M', 'id_2')]

Cidx1  Cidx2
A      C1      -1.05
       C2      -0.51
B      C1      -0.49
       C2       0.58
Name: (M, id_2), dtype: float64

In [45]:
df2.loc[('M', 'id_2'), ('B', 'C1')]

-0.49

In [46]:
df2.loc[:, ('A', 'C2')]

Ridx1  Ridx2
M      id_1    -0.20
       id_2    -0.51
       id_3     0.06
F      id_1    -0.52
       id_2    -0.05
       id_3     0.29
Name: (A, C2), dtype: float64

In [47]:
df2.loc[("All", "All"), :] = df2.sum()
df2

Cidx1                   A           B
Cidx2                  C1    C2    C1    C2
Ridx1 Ridx2
M     id_1  -8.900000e-01 -0.20 -1.31  0.53
      id_2  -1.050000e+00 -0.51 -0.49  0.58
      id_3   1.500000e-01  0.06 -0.95  0.49
F     id_1   1.350000e+00 -0.52  0.15  0.11
      id_2  -9.000000e-01 -0.05  1.18  0.75
      id_3   1.340000e+00  0.29 -0.25  1.17
All   All    2.220446e-16 -0.93 -1.67  3.63

In [48]:
df2.loc["M"]

Cidx1     A           B
Cidx2    C1    C2    C1    C2
Ridx2
id_1  -0.89 -0.20 -1.31  0.53
id_2  -1.05 -0.51 -0.49  0.58
id_3   0.15  0.06 -0.95  0.49

다중인덱스 인덱싱의 튜플 내에서 슬라이싱을 하고 싶다면 `:` 대신 `slice()` 메서드를 사용해야 함  
`slice(마지막 인덱스)`, `slice(시작 인덱스, 마지막 인덱스)`, `slice(시작 인덱스, 마지막 인덱스, 스텝)`

In [49]:
df2.loc[('M', slice(None)),:]

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1  -0.89 -0.20 -1.31  0.53
      id_2  -1.05 -0.51 -0.49  0.58
      id_3   0.15  0.06 -0.95  0.49

In [50]:
df2.loc[:, ('A', slice(None))]

Cidx1                   A
Cidx2                  C1    C2
Ridx1 Ridx2
M     id_1  -8.900000e-01 -0.20
      id_2  -1.050000e+00 -0.51
      id_3   1.500000e-01  0.06
F     id_1   1.350000e+00 -0.52
      id_2  -9.000000e-01 -0.05
      id_3   1.340000e+00  0.29
All   All    2.220446e-16 -0.93

### 다중인덱스의 인덱스 순서 변경
다중 인덱스의 순서를 변경하고 싶으면 `swaplevel(i, j, axis)` 메서드를 사용함  
`i`, `j` 인자: 순서를 변경할 인덱스의 이름 혹은 번호  
`axis` 인자: 0일경우 행 인덱스, 1일 경우 열 인덱스

In [51]:
df2.swaplevel('Ridx1', 'Ridx2', 0)

Cidx1                   A           B
Cidx2                  C1    C2    C1    C2
Ridx2 Ridx1
id_1  M     -8.900000e-01 -0.20 -1.31  0.53
id_2  M     -1.050000e+00 -0.51 -0.49  0.58
id_3  M      1.500000e-01  0.06 -0.95  0.49
id_1  F      1.350000e+00 -0.52  0.15  0.11
id_2  F     -9.000000e-01 -0.05  1.18  0.75
id_3  F      1.340000e+00  0.29 -0.25  1.17
All   All    2.220446e-16 -0.93 -1.67  3.63

In [52]:
df2.swaplevel('Cidx1', 'Cidx2', 1)

Cidx2                  C1    C2    C1    C2
Cidx1                   A     A     B     B
Ridx1 Ridx2
M     id_1  -8.900000e-01 -0.20 -1.31  0.53
      id_2  -1.050000e+00 -0.51 -0.49  0.58
      id_3   1.500000e-01  0.06 -0.95  0.49
F     id_1   1.350000e+00 -0.52  0.15  0.11
      id_2  -9.000000e-01 -0.05  1.18  0.75
      id_3   1.340000e+00  0.29 -0.25  1.17
All   All    2.220446e-16 -0.93 -1.67  3.63

### 다중 인덱스의 정렬
다중 인덱스를 가지고 있는 데이터프레임에서 `sort_index`로 정렬할 때 `level` 인수를 사용하여 어떤 인덱스 기준으로 정렬할지 지정해야 함

In [53]:
df2.sort_index(level=0)

Cidx1                   A           B
Cidx2                  C1    C2    C1    C2
Ridx1 Ridx2
All   All    2.220446e-16 -0.93 -1.67  3.63
F     id_1   1.350000e+00 -0.52  0.15  0.11
      id_2  -9.000000e-01 -0.05  1.18  0.75
      id_3   1.340000e+00  0.29 -0.25  1.17
M     id_1  -8.900000e-01 -0.20 -1.31  0.53
      id_2  -1.050000e+00 -0.51 -0.49  0.58
      id_3   1.500000e-01  0.06 -0.95  0.49

In [54]:
df2.sort_index(level=(1,0))

Cidx1                   A           B
Cidx2                  C1    C2    C1    C2
Ridx1 Ridx2
All   All    2.220446e-16 -0.93 -1.67  3.63
F     id_1   1.350000e+00 -0.52  0.15  0.11
M     id_1  -8.900000e-01 -0.20 -1.31  0.53
F     id_2  -9.000000e-01 -0.05  1.18  0.75
M     id_2  -1.050000e+00 -0.51 -0.49  0.58
F     id_3   1.340000e+00  0.29 -0.25  1.17
M     id_3   1.500000e-01  0.06 -0.95  0.49

In [56]:
df2.sort_index(axis=1, level=0)

Cidx1                   A           B
Cidx2                  C1    C2    C1    C2
Ridx1 Ridx2
M     id_1  -8.900000e-01 -0.20 -1.31  0.53
      id_2  -1.050000e+00 -0.51 -0.49  0.58
      id_3   1.500000e-01  0.06 -0.95  0.49
F     id_1   1.350000e+00 -0.52  0.15  0.11
      id_2  -9.000000e-01 -0.05  1.18  0.75
      id_3   1.340000e+00  0.29 -0.25  1.17
All   All    2.220446e-16 -0.93 -1.67  3.63

#### 파이썬으로 다음 연산을 수행한다.

A 반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

1. “반”, “번호”, “국어”, “영어”, “수학” 을 열로 가지는 데이터프레임 `df_score3`을 만든다.
2. `df_score3`을 변형하여 1차 행 인덱스로 “반”을 2차 행 인덱스로 “번호”을 가지는 데이터프레임 `df_score4`을 만든다.
3. 데이터 프레임 `df_score4`에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.
4. `df_score3`을 변형하여 행 인덱스로 “번호”를, 1차 열 인덱스로 “국어”, “영어”, “수학”을, 2차 열 인덱스로 “반”을 가지는 데이터프레임 `df_score5`을 만든다.
5. 데이터 프레임 `df_score5`에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.

In [95]:
# columns = ['반', '번호', '국어', '영어', '수학']

# data = {
#     '반' : [1, 1, 1, 2, 2, 2],
#     '번호' : [1, 2, 3, 1, 2, 3],
#     '국어' : [60, 80, 90, 70, 100, 50],
#     '영어' : [70, 50, 90, 60, 100, 80],
#     '수학' : [80, 70, 50, 90, 60, 100]

# }
# df_score3 = pd.DataFrame(data, columns = columns)
# df_score3

In [84]:
# 1.
df_score3 = pd.DataFrame({
    '반' : [1, 1, 1, 2, 2, 2],
    '번호' : [1, 2, 3, 1, 2, 3],
    '국어' : [60, 80, 90, 70, 100, 50],
    '영어' : [70, 50, 90, 60, 100, 80],
    '수학' : [80, 70, 50, 90, 60, 100]
})
df_score3

   반  번호   국어   영어   수학
0  1   1   60   70   80
1  1   2   80   50   70
2  1   3   90   90   50
3  2   1   70   60   90
4  2   2  100  100   60
5  2   3   50   80  100

In [87]:
df_score3.set_index(['반', '번호'])

       국어   영어   수학
반 번호
1 1    60   70   80
  2    80   50   70
  3    90   90   50
2 1    70   60   90
  2   100  100   60
  3    50   80  100

In [88]:
df_score4= df_score3.set_index(['반', '번호'])
df_score4

       국어   영어   수학
반 번호
1 1    60   70   80
  2    80   50   70
  3    90   90   50
2 1    70   60   90
  2   100  100   60
  3    50   80  100

In [94]:
# 2.
df_score4['평균']=df_score4.mean(axis=1).round(2)  # axis=1 은 열을 뜻한다.
df_score4

       국어   영어   수학     평균
반 번호
1 1    60   70   80  70.00
  2    80   50   70  66.75
  3    90   90   50  76.75
2 1    70   60   90  73.25
  2   100  100   60  86.75
  3    50   80  100  76.75

In [97]:
# 4.
df_score3.set_index(['반', '번호']).unstack('반')

    국어       영어       수학
반    1    2   1    2   1    2
번호
1   60   70  70   60  80   90
2   80  100  50  100  70   60
3   90   50  90   80  50  100

In [98]:
# 5.
df_score5 = df_score3.set_index(['반', '번호']).unstack('반')
df_score5

    국어       영어       수학
반    1    2   1    2   1    2
번호
1   60   70  70   60  80   90
2   80  100  50  100  70   60
3   90   50  90   80  50  100

In [100]:
# 5
df_score5.loc['평균', :] = df_score5.mean()
df_score5

           국어                영어                수학
반           1           2     1      2          1           2
번호
1   60.000000   70.000000  70.0   60.0  80.000000   90.000000
2   80.000000  100.000000  50.0  100.0  70.000000   60.000000
3   90.000000   50.000000  90.0   80.0  50.000000  100.000000
평균  76.666667   73.333333  70.0   80.0  66.666667   83.333333